🚀&nbsp; env0 had composed a PR Plan for environment [Production / Triggered Environment ](https://app.env0.com/p/abf12c6c-1fd6-4051-a0b8-71cbfdb2f98b/environments/2a9fc5db-e514-48da-92fd-19a9088add71):
```
Plan: 1 to add, 0 to change, 1 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # random_string.random must be replaced
-/+ resource "random_string" "random" {
!       id          = "F5BxOs" -> (known after apply)
!       result      = "F5BxOs" -> (known after apply)
!       special     = false -> true # forces replacement
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!   random_string = "F5BxOs" -> (known after apply)
```
</details>


```
Failed to calculate cost estimation
```


[Full PR Plan logs on env0](https://app.env0.com/p/abf12c6c-1fd6-4051-a0b8-71cbfdb2f98b/environments/2a9fc5db-e514-48da-92fd-19a9088add71/deployments/b24c1a6b-c9d5-4b06-b671-541263589c77)